Hi @poroping, thanks for this thoughtful discussion and analysis. I have created a new branch `test-tf-nb` to help discuss this topic.

**1 Branch Info**

Branch link: https://github.com/fortinetdev/terraform-provider-fortios/commits/test-tf-nb

New features:
- new resource `fortios_routerbgp_neighbor`
- new data source `data_source_router_bgp`
- `force_destroy` for clearing sub tables that have not been set
- clean sub-table for destroy

**2 Behavior of BGP API**

Assume the following settings on the firewall:

```
# config router bgp

myfirewall (bgp) # show
config router bgp
    set as 65000
    config neighbor
        edit "41.10.10.10"
            set soft-reconfiguration enable
            set remote-as 65003
        next
        edit "51.1.1.1"
            set soft-reconfiguration enable
            set remote-as 65002
        next
    end
    config network
        edit 1
            set prefix 33.0.0.0 255.255.255.0
        next
        edit 2
            set prefix 133.0.0.0 255.255.255.0
        next
    end
    config redistribute "connected"
    end
    config redistribute "rip"
    end
    config redistribute "ospf"
    end
    config redistribute "static"
    end
    config redistribute "isis"
    end
    config redistribute6 "connected"
    end
    config redistribute6 "rip"
    end
    config redistribute6 "ospf"
    end
    config redistribute6 "static"
    end
    config redistribute6 "isis"
    end
end

```
Then we configure new neighbors and networks through curl:

```
curl --location --request PUT 'https://192.168.52.177/api/v2/cmdb/router/bgp?access_token=zg3H1x4gcykx6b9h5b44j75hxd9dfg' \
--header 'Content-Type: application/json' \
--data-raw '{
    "as": 65002,
    "neighbor": [
        {
            "ip": "20.10.10.10",
            "remote-as": 65001,
            "soft_reconfiguration ": "enable"
        }
    ],
    "network": [
        {
            "prefix": "33.0.0.0 255.255.255.0",
            "backdoor": "disable",
            "route-map": ""
        }
    ]
}'

```
Let's see the result:
```
myfirewall (bgp) # show
config router bgp
    set as 65000
    config neighbor
        edit "20.10.10.10"
            set remote-as 65001
        next
    end
    config network
        edit 1
            set prefix 122.0.0.0 255.255.255.0
        next
    end
    config redistribute "connected"
    end
    config redistribute "rip"
    end
    config redistribute "ospf"
    end
    config redistribute "static"
    end
    config redistribute "isis"
    end
    config redistribute6 "connected"
    end
    config redistribute6 "rip"
    end
    config redistribute6 "ospf"
    end
    config redistribute6 "static"
    end
    config redistribute6 "isis"
    end
end
```
It can be seen that any new sub-table will overwrite all the old values of the sub-table including network. If the sub-table is not set, the old values will remain there by default, but if the sub-table is assigned a null value in the API, for example [] , the sub-table will be emptied.

The designers of FortiAPI may have designed this based on a principle that they believe is reasonable, terraform also followed the API design. In addition, because the API only provides GET and PUT API method, and no Delete method is provided, so if we want to use the API to empty some sub-table, assign a null value to the sub-table to empty the sub-table. It has been supported in the branch.

**3 About the operation of the API sub-table:**

Many FortiAPI sub-tables have such interfaces, including GET, PUT, POST, DELETE, etc. E.g:

- api/v2/cmdb/firewall.service/group/s111/member
- api/v2/cmdb/system/api-user/1/trusthost

The number of sub-tables and nested sub-tables contained in more than 400 API resources is huge.

**4 Problems caused by mixed operation of main table resources fortios_router_bgp and sub-table resources fortios_routerbgp_neighbor**:

First let us see the following example (with the provider compiled by the test-tf-nb branch):
```
provider "fortios" {
  hostname = "192.168.52.177"
  token    = "zg3H1x4gcykx6b9h5b44j75hxd9dfg"
  insecure = "true"
}

resource "fortios_router_bgp" "fgt_bgp" {
  as = 65000

  neighbor {
    ip                   = "121.1.1.1"
    remote_as            = 65003
    soft_reconfiguration = "enable"
  }
  neighbor {
    ip                   = "122.1.1.1"
    remote_as            = 65003
    soft_reconfiguration = "enable"
  }

}

resource "fortios_routerbgp_neighbor" "s1" {
    ip                   = "123.1.1.1"
    remote_as            = 65003
    soft_reconfiguration = "enable"

  depends_on = [
    fortios_router_bgp.fgt_bgp,
  ]
}
```


```
# terraform apply
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_router_bgp.fgt_bgp will be created
  + resource "fortios_router_bgp" "fgt_bgp" {
      + as                                 = 65000
      + force_destroy                      = false

      + neighbor {
          .................
          + ip                            = "121.1.1.1"
          + remote_as                     = 65003
          + soft_reconfiguration          = "enable"
          + filter_list_in6               = (known after apply)
          + filter_list_out               = (known after apply)
          + filter_list_out6              = (known after apply)
          + holdtime_timer                = (known after apply)
          + interface                     = (known after apply)
          .................
        }
      + neighbor {
          .................
          + ip                            = "122.1.1.1"
          + remote_as                     = 65003
          + soft_reconfiguration          = "enable"
          + filter_list_in6               = (known after apply)
          + filter_list_out               = (known after apply)
          + filter_list_out6              = (known after apply)
          + holdtime_timer                = (known after apply)
          + interface                     = (known after apply)
          .................
        }
    }

  # fortios_routerbgp_neighbor.s1 will be created
  + resource "fortios_routerbgp_neighbor" "s1" {
      + ip                            = "123.1.1.1"
      + remote_as                     = 65003
      + soft_reconfiguration          = "enable"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_router_bgp.fgt_bgp: Creating...
fortios_router_bgp.fgt_bgp: Creation complete after 0s [id=RouterBgp]
fortios_routerbgp_neighbor.s1: Creating...
fortios_routerbgp_neighbor.s1: Creation complete after 0s [id=123.1.1.1]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```
See the result:

```
config router bgp
    set as 65000
    config neighbor
        edit "121.1.1.1"
            set soft-reconfiguration enable
            set remote-as 65003
        next
        edit "122.1.1.1"
            set soft-reconfiguration enable
            set remote-as 65003
        next
        edit "123.1.1.1"
            set soft-reconfiguration enable
            set remote-as 65003
        next
    end
    config redistribute "connected"
    end
    config redistribute "rip"
    end
    config redistribute "ospf"
    end
    config redistribute "static"
    end
    config redistribute "isis"
    end
    config redistribute6 "connected"
    end
    config redistribute6 "rip"
    end
    config redistribute6 "ospf"
    end
    config redistribute6 "static"
    end
    config redistribute6 "isis"
    end
end
```
We can find that the neighbor items created by fortios_router_bgp and fortios_routerbgp_neighbor are successfully sent to the firewall. But execute terraform plan, terraform will prompt that the status is inconsistent, as shown below:

```
# terraform plan
  ----
fortios_router_bgp.fgt_bgp: Refreshing state... [id=RouterBgp]
fortios_routerbgp_neighbor.s1: Refreshing state... [id=123.1.1.1]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # fortios_router_bgp.fgt_bgp will be updated in-place
  ~ resource "fortios_router_bgp" "fgt_bgp" {
        id                                 = "RouterBgp"
        # (42 unchanged attributes hidden)

      - neighbor {
          .................
          - ip                            = "123.1.1.1" -> null
          - keep_alive_timer              = 4294967295 -> null
          - link_down_failover            = "disable" -> null
          - local_as                      = 0 -> null
          - local_as_no_prepend           = "disable" -> null
          - local_as_replace_as           = "disable" -> null
          - maximum_prefix                = 0 -> null
          - maximum_prefix6               = 0 -> null
          - maximum_prefix_threshold      = 75 -> null
          - maximum_prefix_threshold6     = 75 -> null
          .................
        }
        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
Because the neighbor items that fortios_router_bgp reads from the device also include the neighbor items created by fortios_routerbgp_neighbor, not just neighbor items created by itself, so terraform plan will always show inconsistent states.

**5 Merge: Sends all dynamic neighbor items to a BGP module for processing**

Regarding the implementation of MERGE feature, the BGP API doesn't support it. if we implement it by sub-table API, we will have to give up the operation of the top API on the sub-table, otherwise it will cause the problem mentioned in 4. Since the number of the sub-tables plus nested sub-tables contained in all more than 400 FortiAPI resources is surprisingly huge, if all resources are developed based on this method, and abandon the mechanism already implemented by Top API, I think this may not be the best choice, in addition, I don't want too many sub-table resources to dazzle ordinary users. Secondly, for terraform, one of the core challenges of infrastructure as code is keeping an up-to-date record of all deployed infrastructure and their properties. I think this is the main difference from configuration management tools. Terraform figures out how to get to that end state, Terraform will also be aware of any state it created in the past. Some configuration tools does not fully capture the state of the infrastructure. Terraform must store state about your managed infrastructure and configuration. This state is used by Terraform to map real world resources to the configuration. Therefore, in a certain resource, if its sub-table has been configured, then the sub-table attributes should be clearly known by the resource, and only appending to the sub-table means that the sub-table item before append is not controlled by the the resource, this is not conducive to terraform's state maintenance mechanism. The solution I can find (I believe you should have known it already), for example:

(1) Import the existing configuration on the device into terraform by importing in advance, so that terraform can keep awake for all sub-table configurations of the resource;

(2) Sends all neighbor items to a BGP module for processing. Example:

```
# tree
├── bgp2
│   ├── main.tf
│   └── versions.tf
├── maintst.tf
└── versions.tf
```

```
# cat maintst.tf
provider "fortios" {
  hostname = "192.168.52.177"
  token    = "zg3H1x4gcykx6b9h5b44j75hxd9dfg"
  insecure = "true"
}

module "bgp2" {
  source = "./bgp2"

  new_nblist_interface1 = [
    {
      ip                   = "221.11.1.1"
      remote_as            = 65003
      soft_reconfiguration = "enable"
    },
    {
      ip                   = "222.11.1.1"
      remote_as            = 65003
      soft_reconfiguration = "enable"
    }
  ]

  new_nblist_interface2 = [
    {
      ip                   = "31.11.1.1"
      remote_as            = 65003
      soft_reconfiguration = "enable"
    },
    {
      ip                   = "32.11.1.1"
      remote_as            = 65003
      soft_reconfiguration = "enable"
    },
    {
      ip                   = "33.11.1.1"
      remote_as            = 65003
      soft_reconfiguration = "enable"
    }
  ]
}


# cat bgp2/main.tf
variable "new_nblist_interface1" {
  type = list(object({
    ip = string
    remote_as = number
    soft_reconfiguration = string
  }))

  # default = []
}

variable "new_nblist_interface2" {
  type = list(object({
    ip = string
    remote_as = number
    soft_reconfiguration = string
  }))

  # default = []
}

resource "fortios_router_bgp" "fgt_bgp" {
  as = 65000

  dynamic "neighbor" {
    for_each = var.new_nblist_interface1
    content {
      ip                   = neighbor.value["ip"]
      remote_as            = neighbor.value["remote_as"]
      soft_reconfiguration = neighbor.value["soft_reconfiguration"]
    }
  }

  dynamic "neighbor" {
    for_each = var.new_nblist_interface2
    content {
      ip                   = neighbor.value["ip"]
      remote_as            = neighbor.value["remote_as"]
      soft_reconfiguration = neighbor.value["soft_reconfiguration"]
    }
  }
}

```

So that terraform can track the status of all sub-table neighbors' items.

**6 Destroy/clean problem**

For the destroy bug, it has been fixed in the branch and will be merged into the main version later, including related resources with the problem. Regarding whether the content of the unconfigured sub-table needs to be retained after apply, a new parameter force_destroy is added to handle this problem for user.

**My suggestions**

Based on the above experimental results and the current situation, I do not recommend the use of sub-table resources. Of course, if you think the neighbor sub-table resources need to be kept, I will merge it to master and release it after QA testing, but I plan to mark it as 'Debug' to prevent other users from using it, otherwise when the problem in 4 occurs, it will cause confusion to users.

Thank you!



